CSI API ETABS v1
cPropTendon.ChangeName Method
 Changes the name of an existing tendon property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ChangeName(
	string Name,
	string NewName
)
Function ChangeName (
	Name As String,
	NewName As String
) As Integer
Dim instance As cPropTendon
Dim Name As String
Dim NewName As String
Dim returnValue As Integer
returnValue = instance.ChangeName(Name,
	NewName)
int ChangeName(
	String^ Name,
	String^ NewName
)
abstract ChangeName :
        Name : string *
        NewName : string -> int
Parameters
Name
Type: System.String
The existing name of a defined tendon property.
NewName
Type: System.String
The new name for the tendon property.
Return Value
Type: Int32
Returns zero if the new name is successfully applied; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add tendon material
       ret = SapModel.PropMaterial.AddQuick(Name, eMatType.Tendon, , , , , , eMatTypeTendon.ASTM_A416Gr270)
   'set new tendon property
       ret = SapModel.PropTendon.SetProp("T1", Name, 1, 2.25)
   'change name of tendon property
       ret = SapModel.PropTendon.ChangeName("T1", "MyTendon")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropTendon Interface
ETABSv1 Namespace